# TP 4 - Cisco, Routage, DHCP

## I. Topologie 1 : simple

### \1. PrÃ©sentation de la topo

#### A. SchÃ©ma

#### B. Objectifs

Tous les clients du rÃ©seau peuvent joindre leur passerelle.

- `guest1` peut joindre `router1`
- `admin1` peut joindre `router1`

Les clients `guest1` et `admin1` peuvent se joindre.

####C. Tableau des rÃ©seaux

| RÃ©seau | Address       |
| ------ | ------------- |
| admins | `10.4.1.0/24` |
| guests | `10.4.2.0/24` |

#### D. Tableau d'adressage

| Machine | Type         | admins     | guests     |
| ------- | ------------ | ---------- | ---------- |
| admin1  | VM CentOS7   | 10.4.1.11  | x          |
| guest1  | VPCS         | x          | 10.4.2.11  |
| router1 | Router C3600 | 10.4.1.254 | 10.4.2.254 |

### \2. Mise en place

#### A. Topologie GNS3

Drag'n'drop porn :

- drag'n drop d'un routeur C3600 dans GN3
- drag'n'drop de la machine CentOS7 prÃ©cÃ©demment importÃ©e
- drag'n'drop d'un VPCS
- reliez les comme dans le schÃ©ma ci-dessus
- **turn on all the shit**

#### B. DÃ©finition d'IPs statiques

##### >`admin1`

ğŸŒ **Configurer la machine CentOS7** :

-  [dÃ©sactivation de SELinux]()
-  installation de paquets liÃ©s au rÃ©seau, en particulier `traceroute` pour ce TP
-  [dÃ©finition d'une IP statique]() (se rÃ©fÃ©rer au tableau d'adressage)
-  [dÃ©finition d'un nom d'hÃ´te]()

![](./images/admin1_config.png)

##### >`router1`

ğŸŒ **Configurer le routeur** :

-  [dÃ©finition d'une IP statique]() (se rÃ©fÃ©rer au tableau d'adressage)

  ```cisco
  router1#show ip int br
  Interface                  IP-Address      OK? Method Status                Protocol
  FastEthernet0/0            10.4.2.254      YES NVRAM  up                    up      
  FastEthernet1/0            10.4.1.254      YES NVRAM  up                    up      
  router1#
  ```

-  dÃ©finition d'un nom (depuis l'interface de GNS3)

  ![](./images/rename_hostname.png)

##### >`guest1`

ğŸŒ **Configurer le VPCS** :

-  dÃ©finition d'une IP statique

  ```vpcs
  guest1> ip 10.4.2.11 10.4.2.254
  Checking for duplicate address...
  PC1 : 10.4.2.11 255.255.255.0 gateway 10.4.2.254
  
  guest1> sh
  
  NAME   IP/MASK              GATEWAY           MAC                LPORT  RHOST:PORT
  guest1 10.4.2.11/24         10.4.2.254        00:50:79:66:68:00  20007  127.0.0.1:20008
         fe80::250:79ff:fe66:6800/64
  
  guest1> save
  Saving startup configuration to startup.vpc
  .  done
  
  guest1> 
  ```

-  dÃ©finition d'un nom (depuis l'interface de GNS3)

  ![](./images/rename_hostname.png)

##### > VÃ©rification

ğŸŒ VÃ©rifier et **PROUVER** que :

-  `guest1` peut joindre le routeur

  ```cisco
  guest1> ping 10.4.2.254
  84 bytes from 10.4.2.254 icmp_seq=1 ttl=255 time=9.094 ms
  84 bytes from 10.4.2.254 icmp_seq=2 ttl=255 time=6.484 ms
  84 bytes from 10.4.2.254 icmp_seq=3 ttl=255 time=5.303 ms
  84 bytes from 10.4.2.254 icmp_seq=4 ttl=255 time=6.188 ms
  ^C
  guest1> 
  ```

-  `admin1` peut joindre le routeur

  ![](./images/admin1_ping_router1.png)

-  `router1` peut joindre les deux autres machines

  ```cisco
  router1#ping 10.4.1.11
  
  Type escape sequence to abort.
  Sending 5, 100-byte ICMP Echos to 10.4.1.11, timeout is 2 seconds:
  !!!!!
  Success rate is 100 percent (5/5), round-trip min/avg/max = 32/51/64 ms
  router1#ping 10.4.2.11
  
  Type escape sequence to abort.
  Sending 5, 100-byte ICMP Echos to 10.4.2.11, timeout is 2 seconds:
  !!!!!
  Success rate is 100 percent (5/5), round-trip min/avg/max = 32/32/32 ms
  router1#
  ```

- vÃ©rifier la table ARP de `router1`

  . Par vÃ©rifier, j'entends :

  - s'assurer qu'il a bien `guest1` et `admin1` dans sa table ARP

    ```cisco
    router1#show arp      
    Protocol  Address          Age (min)  Hardware Addr   Type   Interface
    Internet  10.4.1.11               0   0800.2736.c73d  ARPA   FastEthernet1/0
    Internet  10.4.2.11               0   0050.7966.6800  ARPA   FastEthernet0/0
    Internet  10.4.1.254              -   cc01.0589.0010  ARPA   FastEthernet1/0
    Internet  10.4.2.254              -   cc01.0589.0000  ARPA   FastEthernet0/0
    router1#
    ```

  - s'assurer que les adresses MAC sont les bonnes (en les affichant directement depuis `guest1` et `admin1`)

    ````cisco
    guest1> sh
    
    NAME   IP/MASK              GATEWAY           MAC                LPORT  RHOST:PORT
    guest1 10.4.2.11/24         10.4.2.254        00:50:79:66:68:00  20007  127.0.0.1:20008
           fe80::250:79ff:fe66:6800/64
    
    guest1> 
    ````

    ![](./images/MAC_address_admin1.png)

    Les addresses MAC sont bien identiques.

#### C. Routage

##### `router1`

Pour voir votre table de routage :

```shell
show ip route
```

##### `admin1`

ğŸŒ **Ajouter une route sur `admin1` pour qu'il puisse joindre le rÃ©seau `guests`**

![](./images/route_admin1.png)

##### `guest1`

ğŸŒ **Ajouter une route sur `guests` pour qu'il puisse joindre le rÃ©seau `admin1` **

```
guest1> sh ip

NAME        : guest1[1]
IP/MASK     : 10.4.2.11/24
GATEWAY     : 10.4.2.254
DNS         : 
MAC         : 00:50:79:66:68:00
LPORT       : 20007
RHOST:PORT  : 127.0.0.1:20008
MTU:        : 1500
```

##### VÃ©rification

ğŸŒ VÃ©rifier et **PROUVER** que :

-  `guest1` peut joindre le `admin1` et rÃ©ciproquement

  ```
  guest1> ping 10.4.1.11
  84 bytes from 10.4.1.11 icmp_seq=1 ttl=63 time=19.413 ms
  84 bytes from 10.4.1.11 icmp_seq=2 ttl=63 time=15.723 ms
  84 bytes from 10.4.1.11 icmp_seq=3 ttl=63 time=14.716 ms
  ^C
  guest1> 
  ```

  ![](./images/admin1_ping_guest1.png)

-  les paquets transitent par `router`

  ![](./images/traceroute.png)

  ```
  guest1> trace 10.4.1.11
  trace to 10.4.1.11, 8 hops max, press Ctrl+C to stop
   1   10.4.2.254   9.738 ms  9.083 ms  9.880 ms
   2   *10.4.1.11   18.268 ms (ICMP type:3, code:10, Host administratively prohibited)
  
  guest1> 
  ```

## II. Topologie 2 : dumb switches

### \1. PrÃ©sentation de la topo

#### A. SchÃ©ma

#### B. Objectifs

Tous les clients du rÃ©seau peuvent joindre leur passerelle. Les clients `guest1` et `admin1` peuvent se joindre

### \2. Mise en place

#### A. Topologie GNS3

#### B. Setup ?

#### C. VÃ©rification

ğŸŒ VÃ©rifier et **PROUVER** que :

- `guest1` peut toujours joindre le `admin1` et rÃ©ciproquement

  ```
  guest1> ping 10.4.1.11
  84 bytes from 10.4.1.11 icmp_seq=1 ttl=63 time=21.420 ms
  84 bytes from 10.4.1.11 icmp_seq=2 ttl=63 time=13.092 ms
  84 bytes from 10.4.1.11 icmp_seq=3 ttl=63 time=19.579 ms
  ^C
  guest1> 
  ```

  ![](./images/ping2admin-guest.png)

- les paquets transitent toujours par `router`

  ```
  guest1> trace 10.4.1.11
  trace to 10.4.1.11, 8 hops max, press Ctrl+C to stop
   1   10.4.2.254   9.624 ms  9.845 ms  9.844 ms
   2   *10.4.1.11   18.692 ms (ICMP type:3, code:10, Host administratively prohibited)
  
  guest1> 
  ```

  ![](./images/traceroute2.png)

## III. Topologie 3 : adding nodes and NAT

### \1. PrÃ©sentation de la topo

#### A. SchÃ©ma

#### B. Objectifs

### \2. Mise en place

#### A. Topologie GNS3

##### Tableau des rÃ©seaux

| Reseau | Address     |
| ------ | ----------- |
| admins | 10.4.1.0/24 |
| guests | 10.4.2.0/24 |

##### Tableau d'adressage

| Machine | Type          | admins     | guests     |
| ------- | ------------- | ---------- | ---------- |
| admin1  | VM CentOS7    | 10.4.1.11  | x          |
| guest1  | VPCS          | x          | 10.4.2.11  |
| guest2  | VPCS          | x          | 10.4.2.12  |
| guest3  | VPCS          | x          | 10.4.2.13  |
| router1 | Routeur C3600 | 10.4.1.254 | 10.4.2.254 |

#### B. VPCS

ğŸŒ **Configurer les VPCS**

- : dÃ©finition d'une IP statique en ajoutant une route pour qu'ils puissent joindre le rÃ©seau `admins`

  ```
  guest2> ip 10.4.2.12 255.255.255.0 10.4.2.254
  Checking for duplicate address...
  PC1 : 10.4.2.12 255.255.255.0 gateway 10.4.2.254
  
  guest2> 
  ```

  ```
  guest3> ip 10.4.2.13 255.255.255.0 10.4.2.254 
  Checking for duplicate address...
  PC1 : 10.4.2.13 255.255.255.0 gateway 10.4.2.254
  
  guest3> 
  ```

ğŸŒ VÃ©rifier et **PROUVER** que les VPCS joignent le rÃ©seau `admins`

```
guest1> ping 10.4.1.11
84 bytes from 10.4.1.11 icmp_seq=1 ttl=63 time=19.452 ms
84 bytes from 10.4.1.11 icmp_seq=2 ttl=63 time=16.792 ms
84 bytes from 10.4.1.11 icmp_seq=3 ttl=63 time=17.330 ms
^C
guest1> 
```

```
guest2> ping 10.4.1.11
84 bytes from 10.4.1.11 icmp_seq=1 ttl=63 time=19.747 ms
84 bytes from 10.4.1.11 icmp_seq=2 ttl=63 time=12.832 ms
84 bytes from 10.4.1.11 icmp_seq=3 ttl=63 time=16.592 ms
^C
guest2> 
```

```
guest3> ping 10.4.1.11
84 bytes from 10.4.1.11 icmp_seq=1 ttl=63 time=19.401 ms
84 bytes from 10.4.1.11 icmp_seq=2 ttl=63 time=17.851 ms
^C
guest3> 
```

#### C. AccÃ¨s WAN

##### Donner un accÃ¨s WAN au routeur

ğŸŒ **Configurer le routeur**

- [rÃ©cupÃ©rer une IP en DHCP]() sur l'interface branchÃ©e au nuage NAT

  ```
  router1#conf t
  Enter configuration commands, one per line.  End with CNTL/Z.
  router1(config)#interface fastEthernet 2/0
  router1(config-if)#ip address dhcp
  router1(config-if)#duplex auto
  router1(config-if)#speed auto
  router1(config-if)#no shut
  router1(config-if)#exit
  router1(config)#exit
  *Mar  1 00:08:44.859: %LINK-3-UPDOWN: Interface FastEthernet2/0, changed state to up
  *Mar  1 00:08:45.859: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet2/0, changed state to up
  router1(config)#exit
  router1#
  *Mar  1 00:08:46.987: %SYS-5-CONFIG_I: Configured from console by console
  router1#copy running-config startup-config
  Destination filename [startup-config]? 
  *Mar  1 00:08:56.795: %DHCP-6-ADDRESS_ASSIGN: Interface FastEthernet2/0 assigned DHCP address 192.168.122.50, mask 255.255.255.0, hostname router1
  
  
  Building configuration...
  [OK]
  router1#show ip int br
  Interface                  IP-Address      OK? Method Status                Protocol
  FastEthernet0/0            10.4.2.254      YES NVRAM  up                    up      
  FastEthernet1/0            10.4.1.254      YES NVRAM  up                    up      
  FastEthernet2/0            192.168.122.50  YES DHCP   up                    up      
  router1#
  ```
  
- [configurer un NAT simple sur le routeur]()

  ```
  router1#show ip int br
  Interface                  IP-Address      OK? Method Status                Protocol
  FastEthernet0/0            10.4.2.254      YES NVRAM  up                    up      
  FastEthernet1/0            10.4.1.254      YES NVRAM  up                    up      
  FastEthernet2/0            192.168.122.50  YES DHCP   up                    up      
  router1#show ip int br
  Interface                  IP-Address      OK? Method Status                Protocol
  FastEthernet0/0            10.4.2.254      YES NVRAM  up                    up      
  FastEthernet1/0            10.4.1.254      YES NVRAM  up                    up      
  FastEthernet2/0            192.168.122.50  YES DHCP   up                    up      
  router1#conf t
  Enter configuration commands, one per line.  End with CNTL/Z.
  router1(config)#interface fastEthernet 0/0
  router1(config-if)#ip nat inside 
  *Mar  1 00:13:08.143: %LINEPROTO-5-UPDOWN: Line protocol on Interface NVI0, changed state to up
  router1(config-if)#exit
  router1(config)#interface fastEthernet 1/0
  router1(config-if)#ip nat inside
  router1(config-if)#exit
  router1(config)#interface fastEthernet 2/0
  router1(config-if)#ip nat outside 
  router1(config-if)#exit
  router1(config)#access-list 1 permit any
  router1(config)#$de source list 1 interface fastEthernet 2/0 overload          
  router1(config)#exit
  router1#
  *Mar  1 00:16:25.635: %SYS-5-CONFIG_I: Configured from console by console
  router1#copy running-config startup-config
  Destination filename [startup-config]? 
  Building configuration...
  [OK]
  ```

  

##### Configurer les clients

ğŸŒ Configurer tous les clients du rÃ©seau (client du rÃ©seau `admins` et clients du rÃ©seau `guests`)

- Si ce n'est pas dÃ©jÃ  fait, ajouter une route par dÃ©faut sur tous les clients du rÃ©seau `admins` (y'en a qu'un) et du rÃ©seau `guests`.

  ```
  guest1> sh ip
  
  NAME        : guest1[1]
  IP/MASK     : 10.4.2.11/24
  GATEWAY     : 10.4.2.254
  DNS         : 
  MAC         : 00:50:79:66:68:00
  LPORT       : 20011
  RHOST:PORT  : 127.0.0.1:20012
  MTU:        : 1500
  
  guest1> 
  ```

  ```
  guest2> sh ip
  
  NAME        : guest2[1]
  IP/MASK     : 10.4.2.12/24
  GATEWAY     : 10.4.2.254
  DNS         : 
  MAC         : 00:50:79:66:68:01
  LPORT       : 20017
  RHOST:PORT  : 127.0.0.1:20018
  MTU:        : 1500
  
  guest2>
  ```

  ```
  guest3> sh ip
  
  NAME        : guest3[1]
  IP/MASK     : 10.4.2.13/24
  GATEWAY     : 10.4.2.254
  DNS         : 
  MAC         : 00:50:79:66:68:02
  LPORT       : 20019
  RHOST:PORT  : 127.0.0.1:20020
  MTU:        : 1500
  
  guest3> 
  ```

  ![](./images/routeAdmin.png)

-  Configurer l'utilisation d'un serveur DNS (mettez 

  ```
  1.1.1.1
  ```

  )

  - pour `admin1`, il y a toujours [une section dans le mÃ©mo CentOS]()
  
    ![](./images/dns1.1.1.1.png)
  
  - pour les VPCS dans le rÃ©seau `guests`... mmmh... dÃ©merdez-vous :)
  
    ```
    guest1> ip dns 1.1.1.1
    
    guest1> sh ip
    
    NAME        : guest1[1]
    IP/MASK     : 10.4.2.11/24
    GATEWAY     : 10.4.2.254
    DNS         : 1.1.1.1  
    MAC         : 00:50:79:66:68:00
    LPORT       : 20011
    RHOST:PORT  : 127.0.0.1:20012
    MTU:        : 1500
    
    guest1> save
    Saving startup configuration to startup.vpc
    .  done
    
    guest1> 
    ```
  
    ```
    guest2> ip dns 1.1.1.1
    
    guest2> sh ip
    
    NAME        : guest2[1]
    IP/MASK     : 10.4.2.12/24
    GATEWAY     : 10.4.2.254
    DNS         : 1.1.1.1  
    MAC         : 00:50:79:66:68:01
    LPORT       : 20017
    RHOST:PORT  : 127.0.0.1:20018
    MTU:        : 1500
    
    guest2> save
    Saving startup configuration to startup.vpc
    .  done
    
    guest2> 
    ```
  
    ```
    guest3> ip dns 1.1.1.1
    
    guest3> sh ip
    
    NAME        : guest3[1]
    IP/MASK     : 10.4.2.13/24
    GATEWAY     : 10.4.2.254
    DNS         : 1.1.1.1  
    MAC         : 00:50:79:66:68:02
    LPORT       : 20019
    RHOST:PORT  : 127.0.0.1:20020
    MTU:        : 1500
    
    guest3> save
    Saving startup configuration to startup.vpc
    .  done
    
    guest3> 
    ```

##### VÃ©rification

ğŸŒ VÃ©rifier et **PROUVER** que :

- le routeur a un accÃ¨s WAN (internet)

  ```
  router1#ping 1.1.1.1                                  
  
  Type escape sequence to abort.
  Sending 5, 100-byte ICMP Echos to 1.1.1.1, timeout is 2 seconds:
  !!!!!
  Success rate is 100 percent (5/5), round-trip min/avg/max = 96/98/108 ms
  router1#
  ```

  

- tous les clients du rÃ©seau `admins` (y'en a toujours qu'un) et ceux du rÃ©seau `guests` ont un accÃ¨s WAN (internet) et que tous les clients du rÃ©seau ont de la rÃ©solution de noms grÃ¢ce au serveur DNS configurÃ©

  ```
  guest1> ping www.google.com
  www.google.com resolved to 172.217.19.228
  84 bytes from 172.217.19.228 icmp_seq=1 ttl=59 time=50.009 ms
  84 bytes from 172.217.19.228 icmp_seq=2 ttl=59 time=47.933 ms
  84 bytes from 172.217.19.228 icmp_seq=3 ttl=59 time=47.813 ms
  ^C
  guest1> 
  ```

  ```
  guest2> ping www.google.com
  www.google.com resolved to 172.217.19.228
  84 bytes from 172.217.19.228 icmp_seq=1 ttl=59 time=49.702 ms
  84 bytes from 172.217.19.228 icmp_seq=2 ttl=59 time=46.514 ms
  84 bytes from 172.217.19.228 icmp_seq=3 ttl=59 time=46.449 ms
  ^C
  guest2> 
  ```

  ```
  guest3> ping www.google.com
  www.google.com resolved to 172.217.19.228
  84 bytes from 172.217.19.228 icmp_seq=1 ttl=59 time=49.504 ms
  84 bytes from 172.217.19.228 icmp_seq=2 ttl=59 time=45.731 ms
  84 bytes from 172.217.19.228 icmp_seq=3 ttl=59 time=46.603 ms
  ^C
  guest3> 
  ```

  ![](./images/accesWanAdmin.png)

## IV. Topologie 4 : home-made DHCP

### \1. PrÃ©sentation de la topo

#### A. SchÃ©ma

#### B. Objectifs

##### Tableau d'adressage

| Machine | Type          | admins     | guests     |
| ------- | ------------- | ---------- | ---------- |
| admin1  | VM CentOS7    | 10.4.1.11  | x          |
| guest1  | VPCS          | x          | DHCP       |
| guest2  | VPCS          | x          | DHCP       |
| guest3  | VPCS          | x          | DHCP       |
| router1 | Routeur C3600 | 10.4.1.254 | 10.4.2.254 |
| dhcp    | VM CentOS7    | x          | 10.4.2.253 |

### \2. Mise en place

#### A. Topologie GNS3

#### B. Setup de la VM

**Configuration de base**

- [ ]  [dÃ©sactivation de SELinux]()
- [ ]  installation de paquets liÃ©s au rÃ©seau, en particulier `traceroute` pour ce TP
- [ ]  [dÃ©finition d'une IP statique]() (se rÃ©fÃ©rer au tableau d'adressage)
- [ ]  [dÃ©finition d'un nom d'hÃ´te]()
- [ ]  [ajout de la route par dÃ©faut]()

**Configuration du serveur DHCP**

- [ ]  insttallation du paquet `dhcp`

- [ ]  configurer le fichier 

  ```
  /etc/dhcp/dhcpd.conf
  ```

  - je vous ai fait [un p'tit modÃ¨le prÃ©-configurÃ© et commentÃ©](). *C'est pas bo Ã§a ?*

- [ ]  dÃ©marrer le service `dhcpd`

```
$ sudo systemctl start dhcpd
```

ğŸŒ VÃ©rifier et **PROUVER** que :

- vous avez des ports UDP en Ã©coute (regardez sur internet les ports utilisÃ©s par DHCP)

  Les ports UDP 67 et 68 sont les ports standards utilisÃ©s pour le dhcp.

  ![](./images/ssUDPdhcp.png)

ğŸŒ Tester le DHCP :

- attribuez une IP en DHCP Ã  l'un des membres du rÃ©seau `guests` (un VPCS) et vÃ©rifiez et prouvez que vous rÃ©cupÃ©rez, en plus de l'IP, l'adresse de la passerelle

```
guest1> ip dhcp    
DDORA IP 10.4.2.100/24 GW 10.4.2.254

guest1> save
Saving startup configuration to startup.vpc
.  done

guest1> 
```

ğŸŒ Observer et mettre en Ã©vidence les Ã©changes DHCP (ouÃ© change "DORA")

- vous pouvez faire Clic droit sur un lien dans GNS3 et dÃ©marrer une capture Wireshark

- trames Ã  observer :

  - Discover*

  - *Offer*
  - *Request*
  - *Acknowledge*

![](./images/wireshark.png)

![]()

